---- ОБЩИ ЗАДАЧИ - 30.03.2021 г. ----

-- 01. За базата от данни MOVIES
USE MOVIES

-- 01.1. Напишете заявка, която извежда заглавие и година на всички филми, които са по-дълги от 120 минути и са снимани преди 2000 г.
--       Ако дължината на филма е неизвестна, заглавието и годината на този филм също да се изведат.
SELECT TITLE, YEAR, LENGTH
FROM MOVIE
WHERE YEAR < 2000 AND (LENGTH > 120 OR LENGTH IS NULL);

-- 01.2. Напишете заявка, която извежда име и пол на всички актьори (мъже и жени), чието име започва с 'J' и са родени след 1948 година.
--       Резултатът да бъде подреден по име в намаляващ ред.
SELECT NAME, GENDER
FROM MOVIESTAR
WHERE NAME LIKE 'J%' AND YEAR(BIRTHDATE) > 1948
ORDER BY NAME DESC;

-- 01.3. Напишете заявка, която извежда име на студио и брой на актьорите, участвали във филми, които са създадени от това студио.
SELECT STUDIONAME, COUNT(DISTINCT STARNAME) AS NUM_ACTORS
FROM STARSIN JOIN MOVIE ON MOVIETITLE = TITLE
GROUP BY STUDIONAME
HAVING COUNT(STARNAME) > 0;

-- 01.4. Напишете заявка, която за всеки актьор извежда име на актьора и броя на филмите, в които актьорът е участвал.
SELECT STARNAME, COUNT(MOVIETITLE) AS NUM_MOVIES
FROM STARSIN
GROUP BY STARNAME;

-- 01.5. Напишете заявка, която за всяко студио извежда име на студиото и заглавие на филма, излязъл последно на екран за това студио.
SELECT ST.STUDIONAME, M.TITLE, ST.Y
FROM (SELECT STUDIONAME, MAX(YEAR) AS Y FROM MOVIE GROUP BY STUDIONAME) AS ST JOIN MOVIE AS M ON ST.STUDIONAME = M.STUDIONAME AND ST.Y = M.YEAR  

-- 01.6. Напишете заявка, която извежда името на най-младия актьор (мъж).
SELECT TOP 1 NAME
FROM MOVIESTAR
WHERE GENDER = 'M'
ORDER BY BIRTHDATE DESC

-- 01.7. Напишете заявка, която извежда име на актьор и име на студио за тези актьори, участвали в най-много филми на това студио.


-- 01.8. Напишете заявка, която извежда заглавие и година на филма и брой на актьорите, участвали в този филм, за тези филми с повече от двама актьори.
SELECT M1.TITLE, M2.YEAR, ACTORS_COUNT AS NUM_ACTORS 
FROM (SELECT TITLE, COUNT(STARNAME) AS ACTORS_COUNT FROM MOVIE JOIN STARSIN ON TITLE = MOVIETITLE GROUP BY TITLE HAVING COUNT(STARNAME) > 2) AS M1 JOIN MOVIE AS M2 ON M1.TITLE = M2.TITLE;

-- 02. За базата от данни SHIPS
USE SHIPS

-- 02.1. Напишете заявка, която извежда имената на всички кораби без повторения, които са участвали в поне една битка и чиито имена започват с C или K.


-- 02.2. Напишете заявка, която извежда име и държава на всички кораби, които никога не са потъвали в битка (може и да не са участвали).


-- 02.3. Напишете заявка, която извежда държавата и броя на потъналите кораби за тази държава. 
--       Държави, които нямат кораби или имат кораб, но той не е участвал в битка, също да бъдат изведени.


-- 02.4. Напишете заявка, която извежда име на битките, които са по-мащабни (с повече участващи кораби) от битката при Guadalcanal.


-- 02.5. Напишете заявка, която извежда име на битките, които са по-мащабни (с повече участващи страни) от битката при Surigao Strait.


-- 02.6. Напишете заявка, която извежда имената на най-леките кораби с най-много оръдия.
SELECT S.NAME, CL.DISPLACEMENT, CL.NUMGUNS
FROM (SELECT CLASS, DISPLACEMENT, NUMGUNS FROM CLASSES WHERE DISPLACEMENT <= ALL(SELECT DISPLACEMENT FROM CLASSES)) AS CL JOIN SHIPS AS S ON CL.CLASS = S.CLASS
WHERE CL.NUMGUNS >= ALL(SELECT NUMGUNS FROM CLASSES WHERE DISPLACEMENT <= ALL(SELECT DISPLACEMENT FROM CLASSES));

-- 02.7. Изведете броя на корабите, които са били увредени в битка, но са били поправени и по-късно са победили в друга битка.


-- 02.8. Изведете име на корабите, които са били увредени в битка, но са били поправени и по-късно са победили в по-мащабна битка (с повече кораби).


-- 03. За базата от данни PC
USE PC

-- 03.1. Напишете заявка, която извежда всички модели лаптопи, за които се предлагат както разновидности с 15" екран, така и с 11" екран.


-- 03.2. Да се изведат различните модели компютри, чиято цена е по-ниска от найевтиния лаптоп, произвеждан от същия производител.


-- 03.3. Един модел компютри може да се предлага в няколко разновидности с различна цена.
--		 Да се изведат тези модели компютри, чиято средна цена (на различните му разновидности) е по-ниска от най-евтиния лаптоп, произвеждан от същия производител.


-- 03.4. Напишете заявка, която извежда за всеки компютър код на продукта, производител и брой компютри, които имат цена, по-голяма или равна на неговата.